{
    "Nav":"Home",
    "Nav_1":"PROJECTS",
    "Nav_2":"experience",
    "Nav_3":"Certifications",
    "Nav_4":"About",
    "Nav_5":"contact",
    "title":"Computer Programmer",
    "description":"Passionate computer programmer creating high–performance software and applications to meet user needs with excellence.",
    "button_1":"know more",
    "project":"projects",
    "portfolio":"Discover my most recent achievements",
    "experience_1":"experience", 
    "Experience":"My Skills section showcases my knowledge of programming languages and shows my willingness to constantly learn new technologies.",
    "p_0":"about",
    "p_1":"As an enthusiastic computer enthusiast and determined candidate, I am motivated by a strong desire to succeed in this field. I have earned my bachelor\u0027s degree in computer science from the university and I\u0027m a recent graduate from La Cité College, having successfully completed my computer science program of study. These accomplishments have reinforced my skills and kept me up–to–date with the latest trends in the computer industry, making me ready to take on new challenges in this exciting field.",
    "p_2":"I am a reliable and experienced collaborator who knows how to work effectively in a team. I am open–minded and have a keen sense of listening, which allows me to understand the needs of my colleagues and help them achieve their goals. My meticulous attention to detail, as well as my experience in problem–solving as part of a team, make me a valuable member of any organization. I am convinced that my passion for computer science, my dedication, and my strong technical skills will allow me to contribute significantly to your company.",
    "contact_item_1":"I am open to talk regarding full–time or part–time opportunities. Fell free to contact me using your preferred medium.",
    "contact_item_2":"name",
    "contact_item_3":"submit",

    "back":"Back",

    "desciption":"Description",
    "projet1_description":"Featuring an intuitive and engaging user experience, this e–commerce site showcases front–end development skills. Designed with CSS, HTML, JavaScript and React JS technologies, this site offers smooth navigation and attractive product presentation, allowing users to easily find what they are looking for.",
    "projet1_realise":"This project was carried out in collaboration by me and two other people as part of our academic studies.",

    "projet2_description":"I created an academic portfolio that shows my projects using HTML, CSS, JavaScript and Tailwind. I wanted to use the most modern technologies to build an elegant and easy to navigate website, and I chose to use Tailwind to give my site a professional and modern look. Moreover, I have designed my website with a responsive design, which means that it automatically adapts to the size of the user\u0027s screen to provide an optimal user experience on any type of device, whether it is either on desktop, tablet or smartphone.",
    "projet2_realise":"This project was carried out by Riad Benosmane",

    "cv_1":"Objective",
    "cv_2":"To obtain a Web Programmer position where I can utilize my technical skills and knowledge to contribute to the success of the organization and advance my career.",

    "cv_3":"Profile",
    "cv_4":"Technical Skills",
    "cv_5":"Education",
    "cv_6":"DEC. Ontario College Diploma",
    "cv_7":"Computer programming",
    "cv_8":"La cité College, Ottawa, Canada | Sept 2021 – Apr 2023",
    "cv_9":"B.Sc Bachelor of Science",
    "cv_10":"Computer Science",
    "cv_11":"Djilali liabes university, Sidi Bel Abbes, Algeria | Sept 2018 – June 2021",
    "cv_12":"This diploma is recognized by the Quebec Ministry of Immigration as equivalent to a bachelor\u0027s degree.",

    "qualification_1":"Experience in web development using technologies such as JavaScript, TypeScript, Angular, ReactJS, Next.js, Node.js, prisma, and tanStack query as well as ASP.NET.",
    "qualification_2":"Solid knowledge of HTML, CSS, Bootstrap, Tailwind, and responsive web design.",
    "qualification_3":"Knowledge of APIs and (UI/UX) principles and designs.",
    "qualification_4":"Experience in database development and solid knowledge of database management systems such as SQL Server, PostgreSQL, MongoDB and Oracle.",
    "qualification_5":"Solid understanding of object–oriented software design and development concepts.",
    "qualification_6":"Experience in programming languages and object–oriented programming principles using Java and C#",
    "qualification_7":"Familiarity with software development life cycle and design patterns.",
    "qualification_8":"Experience in using GitHub, Git, and version control systems.",
    "qualification_9":"Good knowledge of Android and iOS development (Android Studio/Swift UI).",
    "qualification_10":"Contribution to software quality assurance processes, experience in writing unit tests.",
    "qualification_11":"Good understanding of algorithms and data structures.",
    "qualification_12":"Solid knowledge of Microsoft Visual Studio.NET, Adobe products, Microsoft Office, Mac computers, and MS Excel.",
   
    "Experience_0":"Professional Experience",
    "Experience_1":"Responsible for installing, configuring, and maintaining computers to ensure smooth operation.",
    "Experience_2":"Assisted clients in connecting to the Internet and resolving technical issues.",
    "Experience_3":"Monitored client activities and protected equipment and the network against security threats.",
    "Experience_4":"Provided training and support to clients on basic computer operations and software applications, ensuring a professional and welcoming environment for customers.",
    "Experience_5":"Technician (Cybercafe) :",
    "Experience_6":"June 2018– May 2020 | Sidi bel abbes, Algeria (Part–Time)",

    "certfification":"Professional Certifications"
}