{
    "Nav":"acceuil",
   "Nav_1":"PROJETS",
   "Nav_2":"expérience",
   "Nav_3":"Certifications",
   "Nav_4":"à propos",
   "Nav_5":"contact",
   "title":"Programmeur Informatique",
   "description":"Programmeur informatique passionné créant des logiciels et des applications haute performance pour répondre aux besoins des utilisateurs avec excellence.",
   "button_1":"savoir plus",
   "project":"projets",
   "portfolio":"Découvrez mes réalisations les plus récentes", 
   "experience_1":"expérience", 
   "Experience":"Ma section Compétences présente mes connaissances en langages de programmation et montre ma volonté de constamment apprendre de nouvelles technologies.",
   "p_0":"À propos",
   "p_1":"En tant qu\u0027enthousiaste passionné d\u0027informatique et candidat déterminé, je suis motivé par un fort désir de réussir dans ce domaine. J\u0027ai obtenu mon baccalauréat en informatique de l\u0027université et je suis un récent diplômé du Collège La Cité, ayant complété avec succès mon programme d\u0027études en informatique. Ces réalisations ont renforcé mes compétences et m\u0027ont tenu au courant des dernières tendances de l\u0027industrie informatique, ce qui m\u0027a préparé à relever de nouveaux défis dans ce domaine passionnant.",      
   "p_2":"Je suis un collaborateur fiable et expérimenté qui sait travailler efficacement en équipe. Je suis ouvert d\u0027esprit et j\u0027ai un sens aigu de l\u0027écoute, ce qui me permet de comprendre les besoins de mes collègues et de les aider à atteindre leurs objectifs. Mon attention méticuleuse aux détails, ainsi que mon expérience de résolution de problèmes en équipe, font de moi un membre précieux de toute entreprise. Je suis convaincu que ma passion pour l\u0027informatique, mon dévouement et mes compétences techniques solides me permettront de contribuer de manière significative à votre entreprise.",        
   "contact_item_1":"Je suis ouvert à discuter d\u0027opportunités à temps plein ou à temps partiel. N\u0027hésitez pas à me contacter en utilisant votre média préféré.",
   "contact_item_2":"nom",
   "contact_item_3":"soumettre",
   
   "back":"Revenir",

   "desciption":"Déscription",
   "projet1_description":"Présentant une expérience utilisateur intuitive et attrayante, ce site e–commerce met en valeur les compétences en développement front–end. Conçu avec les technologies CSS, HTML, JavaScript et React JS, ce site offre une navigation fluide et une présentation de produits attrayante, permettant aux utilisateurs de trouver facilement ce qu\u0027ils cherchent.",
   "projet1_realise":"Ce projet a été réalisé en collaboration par moi et deux autres personnes dans le cadre de nos études académiques.",
   
   "projet2_description":"J\u0027ai créé un portfolio académique qui montre mes projets en utilisant HTML, CSS, JavaScript et Tailwind. J\u0027ai voulu utiliser les technologies les plus modernes pour construire un site web élégant et facile à naviguer, et j\u0027ai choisi d\u0027utiliser Tailwind pour donner à mon site un look professionnel et moderne. De plus, j\u0027ai conçu mon site web avec un design responsive, ce qui signifie qu\u0027il s\u0027adapte automatiquement à la taille de l\u0027écran de l\u0027utilisateur pour offrir une expérience utilisateur optimale sur tout type de périphérique, que ce soit sur ordinateur de bureau, tablette ou smartphone.",
   "projet2_realise":"Ce projet a été réalisé par Riad Benosmane",

   "projet3_description":"Cette application de météo est conçue pour fournir des informations en temps réel sur la météo de différents pays et villes. Elle est créée à l'aide des technologies web comme React, CSS, HTML et JavaScript et utilise l'API d'OpenWeather pour récupérer les données météorologiques. L'interface utilisateur de l'application est conviviale et facile à naviguer. Elle permet à l'utilisateur de rechercher une ville ou un pays spécifique pour afficher les informations météorologiques actuelles.L'application est régulièrement mise à jour pour garantir la précision des données météorologiques et la disponibilité de nouvelles fonctionnalités. Elle peut être utilisée sur différents appareils, tels que les ordinateurs de bureau, les tablettes et les smartphones, et offre une expérience utilisateur cohérente sur tous les dispositifs.",
   "projet3_realise":"Ce projet a été réalisé par Riad Benosmane",


   "cv_1":"Objectif",
   "cv_2":"Obtenir un poste de Programmeur Web où je peux utiliser mes compétences techniques et mes connaissances pour contribuer au succès de l\u0027organisation et faire avancer ma carrière.",

   "cv_3":"Profil",
   "cv_4":"Compétences techniques",
   "cv_5":"Formations",
   "cv_6":"Diplôme d\u0027étude collégiale (DEC)",
   "cv_7":"Programmation informatique",
   "cv_8":"Collège La cité, Ottawa, Canada | Sept 2021 – Avril 2023",
   "cv_9":"Baccalauréat en informatique",
   "cv_10":"Science de l\u0027informatique",
   "cv_11":"Université Djilali liabes, Sidi Bel Abbes, Algérie | Sept 2018 – Juin 2021 ",
   "cv_12":"Ce diplôme est reconnu par le ministère de l\u0027Immigration du Québec comme étant équivalent à un baccalauréat.",
   
   "qualification_1":"Expérience en développement web utilisant des technologies telles que JavaScript, TypeScript, Angular, ReactJS, Next.js, Node.js, prisma et tanStack query, ainsi qu\u0027ASP.NET.",
   "qualification_2":"Connaissance solide de HTML, CSS, Bootstrap, Tailwind et de la Conception de sites web responsives ",
   "qualification_3":"Connaissance des principes et des conceptions des API et de l\u0027interface utilisateur (UI) / expérience utilisateur (UX).",
   "qualification_4":"Expérience en développement de bases de données et Connaissance solide des systèmes de gestion de bases de données tels que SQL Server, PostgreSQL, MongoDB et Oracle.",
   "qualification_5":"Compréhension solide des concepts de conception et de développement de logiciels orientés objet.",
   "qualification_6":"Expérience en langages de programmation et les principes de la programmation orientée objet en utilisant Java et C#.",
   "qualification_7":"Familiarité avec le cycle de vie du développement de logiciels et les modèles de conception.",
   "qualification_8":"Expérience dans l\u0027utilisation de Git Hub, Git et des systèmes de contrôle de version.",
   "qualification_9":"Bonne connaissance du développement pour Android et iOS (Android Studio/Swift UI).",
   "qualification_10":"Contribution aux processus d\u0027assurance qualité des logiciels, expérience en écriture de tests unitaires.",
   "qualification_11":"Bonne compréhension des algorithmes et des structures de données.",
   "qualification_12":"Solide connaissance de Microsoft Visual Studio.NET, des produits Adobe, de Microsoft Office et des ordinateurs Mac. MS Excel.",
   
   "Experience_0":"Expérience Professionnelle",
   "Experience_1":"Responsable de l\u0027installation, la configuration et la maintenance des ordinateurs pour assurer un fonctionnement fluide.",
   "Experience_2":"Aidé les clients à se connecter à Internet et à résoudre les problèmes techniques.",
   "Experience_3":"Surveillé les activités des clients et protégé les équipements et le réseau contre les menaces de sécurité.",
   "Experience_4":"Fourni une formation et un support aux clients sur les opérations de base de l\u0027ordinateur et les applications logicielles, assurant un environnement professionnel et accueillant pour les clients.",
   "Experience_5":"Technicien (Cybercafé) :",
   "Experience_6":"Juin 2018 – Mai 2020 | Sidi bel abbés, Algérie (à temps partiel)",

   "certfification":"Certifications professionnelles"
}